{
  "upcoming": [
  ],
  "past": [
    {
      "image": "/images/curriculum/seminar/luis.jpg",
      "title": "Luis Garcia",
      "date": "April 05, 2023",
      "speakerDescription": "Luis Garcia is a Research Assistant Professor at the University of Southern California Computer Science Department and a Research Lead in the Cybersecurity and Networking Division at the University of Southern California Information Sciences Institute (USC ISI). He was previously a Postdoctoral Scholar in the Networked and Embedded Systems Laboratory (NESL) at the University of California, Los Angeles (UCLA) Electrical and Computer Engineering Department since. His research interests include the safety and security of learning-enabled cyber-physical systems, industrial control system security and verification, explainable machine learning for sensor data, and malware analysis and reverse engineering. He obtained his Ph.D. in Computer Engineering with a Cyber Security track working on the safety and security of cyber-physical industrial control systems at Rutgers University in 2018.",
      "talkDescription": ""
    },
    {
      "image": "/images/curriculum/seminar/swabha.jpg",
      "title": "Swabha Swayamdipta: \"Contextualizing Bias in Hate Speech Detection\"",
      "date": "February 01, 2023",
      "speakerDescription": "Swabha Swayamdipta is an Assistant Professor of Computer Science in the USC Viterbi School of Engineering, where she leads the DILL Lab. Her research interests broadly span Natural Language Processing and Machine Learning.",
      "talkDescription": "In this talk, Swayamdipta discusses how debiasing an already-trained model is not as effective as relabeling the training data, and how annotator beliefs can be associated with their ratings of toxicity of hate speech.",
      "recording": "https://urldefense.com/v3/__https://usc.zoom.us/rec/share/drS3vlcWzAzWVakidGLPDkklyrJ5QXO41Yugso_gAwjcDEb18nfoBY2A1c-fexbT.ZgCZaYzo1nsuVXDA__;!!LIr3w8kk_Xxm!sGgZJh-YWa7jodOea1bdzHGnrvNLyY-Da6IyDx-XTaSZT8uwb5tUKeN27QyJmf07f2z5HV8Q0E54KzfUqg$",
      "slides": "https://drive.google.com/file/d/1ZB5yxmitysJ-fD_2mEXPVpQUvneZoPSR/view"
    },
    {
      "image": "/images/curriculum/seminar/jesse.jpg",
      "title": "Jesse Thomason: \"Natural Language Processing and Robotics\"",
      "date": "November 09, 2022",
      "speakerDescription": "Jesse Thomason is an Assistant Professor of Computer Science in the USC Viterbi School of Engineering, where he leads the GLAMOR Lab. His research interests bring together natural language processing and robotics to connect language to the world (RoboNLP). He is interested in connecting language to agent perception and action, and lifelong learning through interaction.",
      "talkDescription": "In this talk, Thomason discusses why robots need language and the challenges of translating language instructions into agent movement plans.",
      "slidesProtected": "https://docs.google.com/presentation/d/1U5ylpTi4fHxarrKatpUUVdkA2kZkPTNGD8A5do9lX4I/edit?usp=sharing"
    },
    {
      "image": "/images/curriculum/seminar/zane.jpg",
      "title": "Zane Durante: \"AI-Assisted Care and Multi-Object, Multi-Actor Activity Parsing\"",
      "date": "October 26, 2022",
      "speakerDescription": "Zane Durante PhD student in Computer Science and is advised by Prof. Fei-Fei Li. His research interests include self-supervised learning, multimodal signal processing, and AI for healthcare.",
      "talkDescription": "In this talk, Durante discusses his projects that span graph-based annotation of multi-object, multi-actor activity parsing and AI in healthcare.",
      "slides": "https://docs.google.com/presentation/d/1xt0ZqgU842shLA_-p2h2x3TqQiqUptyUZzTJrJfhOuo/edit?usp=sharing"
    }
  ]
}